BellerageHackathon/src/Catalogs/КандидатыВнешние/КандидатыВнешние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КандидатыВнешние</name>
  <attributes>
    <name>ИдентификаторКандидата</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображаемоеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияЭлемент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/КандидатыВнешние/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторКандидата) Тогда
		ИдентификаторКандидата = Новый УникальныйИдентификатор;
	КонецЕсли;

	Активен = Истина;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторКандидата) Тогда
		ИдентификаторКандидата = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ОтображаемоеИмя)) Тогда
		ВызватьИсключение "Не заполнено отображаемое имя кандидата.";
	КонецЕсли;

	ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кандидаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КандидатыВнешние КАК Кандидаты
	|ГДЕ
	|	Кандидаты.Ссылка <> &Ссылка
	|	И Кандидаты.ИдентификаторКандидата = &ИдентификаторКандидата";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторКандидата", ИдентификаторКандидата);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор кандидата уже используется.";
	КонецЕсли;

КонецПроцедуры
